src/1C/Enums/МестоЛокацииПараметра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МестоЛокацииПараметра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелоЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шаблон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Куки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/1C/Enums/МестоЛокацииПараметра/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Функция МестоЛокации(Локация) Экспорт
	Струкутра = Новый Соответствие;
	Струкутра.Вставить(Перечисления.МестоЛокацииПараметра.ТелоЗапроса, "query");
	Струкутра.Вставить(Перечисления.МестоЛокацииПараметра.Заголовок, "header");
	Струкутра.Вставить(Перечисления.МестоЛокацииПараметра.Шаблон, "path");
	Струкутра.Вставить(Перечисления.МестоЛокацииПараметра.Куки, "cookie");
	
	Возврат Струкутра[Локация];
КонецФункции
#КонецОбласти
